In [54]:
import pandas as pd
import numpy as np
import math as m

In [55]:
data = {
    'Name': ['Abhinav', 'Abhijai', 'Aarushi', 'Aadarsh', 'Arnav','Aeikansh','Hemang','Hemant'],
    'Age':[24, 21, 22, 27, 29,12,32,54],
    'Gender' : ["M", "M", "F","M","M","M","M" ,"M"],
    'Score': [85.0, np.nan, 99, 88.0, 76.5,34,79,90],
    'Highmarks':[99,np.nan,94,np.nan,97,np.nan,np.nan,np.nan]
}

In [56]:
d=pd.DataFrame(data)

In [57]:
d

       Name  Age Gender  Score  Highmarks
0   Abhinav   24      M   85.0       99.0
1   Abhijai   21      M    NaN        NaN
2   Aarushi   22      F   99.0       94.0
3   Aadarsh   27      M   88.0        NaN
4     Arnav   29      M   76.5       97.0
5  Aeikansh   12      M   34.0        NaN
6    Hemang   32      M   79.0        NaN
7    Hemant   54      M   90.0        NaN

In [58]:
features=d.columns

features

In [59]:
features

Index(['Name', 'Age', 'Gender', 'Score', 'Highmarks'], dtype='object')

In [60]:
count=0;

cols_with_missing = [col for col in d.columns
                     if d[col].isnull().any()]

In [61]:
cols_with_missing

['Score', 'Highmarks']

In [86]:
def simpleimputer(column):
    imputed=column.mean()
    return column.fillna(imputed)

In [87]:
for i in cols_with_missing:
    d[i]=simpleimputer(d[i])

In [88]:
d

       Name  Age Gender      Score  Highmarks
0   Abhinav   24      M  85.000000  99.000000
1   Abhijai   21      M  78.785714  96.666667
2   Aarushi   22      F  99.000000  94.000000
3   Aadarsh   27      M  88.000000  96.666667
4     Arnav   29      M  76.500000  97.000000
5  Aeikansh   12      M  34.000000  96.666667
6    Hemang   32      M  79.000000  96.666667
7    Hemant   54      M  90.000000  96.666667